In [1]:
! pip install pandas

import pandas as pd

Requirement already satisfied: pandas in c:\users\jesie\onedrive\área de trabalho\jesiel\.venv\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.23.2 in c:\users\jesie\onedrive\área de trabalho\jesiel\.venv\lib\site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\jesie\onedrive\área de trabalho\jesiel\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\jesie\onedrive\área de trabalho\jesiel\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\jesie\onedrive\área de trabalho\jesiel\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\jesie\onedrive\área de trabalho\jesiel\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
pd.read_csv('dataset_vendas.csv', sep=';')

,ID_Pedido,Data_Compra,Cliente_ID,Valor_Total,Categoria_Produto,Quantidade
0,1001,2024-01-01,551,607.50,Roupas,1
1,1002,2024-01-02,592,758.17,Beleza,2
2,1003,2024-01-05,514,460.08,Roupas,6
3,1004,2024-01-04,571,171.20,Eletrônicos,5
4,1005,2024-01-05,560,319.59,Beleza,7
...,...,...,...,...,...,...
995,1996,2026-09-22,509,834.76,Beleza,4
996,1997,2026-09-23,566,792.93,Esportes,3
997,1998,2026-09-24,517,723.31,Beleza,3
998,1999,2026-09-25,599,84.35,Beleza,3
999,2000,2026-09-26,585,337.97,Eletrônicos,6

In [3]:
dataset_vendas = pd.read_csv('dataset_vendas.csv', sep=';')

In [4]:
dataset_vendas.head()

,ID_Pedido,Data_Compra,Cliente_ID,Valor_Total,Categoria_Produto,Quantidade
0,1001,2024-01-01,551,607.50,Roupas,1
1,1002,2024-01-02,592,758.17,Beleza,2
2,1003,2024-01-05,514,460.08,Roupas,6
3,1004,2024-01-04,571,171.20,Eletrônicos,5
4,1005,2024-01-05,560,319.59,Beleza,7

In [5]:
dataset_vendas.tail()

,ID_Pedido,Data_Compra,Cliente_ID,Valor_Total,Categoria_Produto,Quantidade
995,1996,2026-09-22,509,834.76,Beleza,4
996,1997,2026-09-23,566,792.93,Esportes,3
997,1998,2026-09-24,517,723.31,Beleza,3
998,1999,2026-09-25,599,84.35,Beleza,3
999,2000,2026-09-26,585,337.97,Eletrônicos,6

In [6]:
dataset_vendas.shape

(1000, 6)

In [7]:
dataset_vendas.info

<bound method DataFrame.info of      ID_Pedido Data_Compra  Cliente_ID  Valor_Total Categoria_Produto  \
0         1001  2024-01-01         551       607.50            Roupas
1         1002  2024-01-02         592       758.17            Beleza
2         1003  2024-01-05         514       460.08            Roupas
3         1004  2024-01-04         571       171.20       Eletrônicos
4         1005  2024-01-05         560       319.59            Beleza
..         ...         ...         ...          ...               ...
995       1996  2026-09-22         509       834.76            Beleza
996       1997  2026-09-23         566       792.93          Esportes
997       1998  2026-09-24         517       723.31            Beleza
998       1999  2026-09-25         599        84.35            Beleza
999       2000  2026-09-26         585       337.97       Eletrônicos

     Quantidade
0             1
1             2
2             6
3             5
4             7
..          ...
995           4
996           3
997           3
998           3
999           6

[1000 rows x 6 columns]>

In [8]:
dataset_vendas.describe

<bound method NDFrame.describe of      ID_Pedido Data_Compra  Cliente_ID  Valor_Total Categoria_Produto  \
0         1001  2024-01-01         551       607.50            Roupas
1         1002  2024-01-02         592       758.17            Beleza
2         1003  2024-01-05         514       460.08            Roupas
3         1004  2024-01-04         571       171.20       Eletrônicos
4         1005  2024-01-05         560       319.59            Beleza
..         ...         ...         ...          ...               ...
995       1996  2026-09-22         509       834.76            Beleza
996       1997  2026-09-23         566       792.93          Esportes
997       1998  2026-09-24         517       723.31            Beleza
998       1999  2026-09-25         599        84.35            Beleza
999       2000  2026-09-26         585       337.97       Eletrônicos

     Quantidade
0             1
1             2
2             6
3             5
4             7
..          ...
995           4
996           3
997           3
998           3
999           6

[1000 rows x 6 columns]>

In [9]:
dataset_vendas.describe(include='all')

,ID_Pedido,Data_Compra,Cliente_ID,Valor_Total,Categoria_Produto,Quantidade
count,1000.000000,1000,1000.000000,1000.000000,1000,1000.000000
unique,NaN,612,NaN,NaN,5,NaN
top,NaN,2025-02-09,NaN,NaN,Esportes,NaN
freq,NaN,6,NaN,NaN,220,NaN
mean,1500.500000,NaN,549.128000,525.307940,NaN,4.945000
std,288.819436,NaN,29.573505,275.969012,NaN,2.614347
min,1001.000000,NaN,500.000000,54.400000,NaN,1.000000
25%,1250.750000,NaN,523.000000,275.285000,NaN,3.000000
50%,1500.500000,NaN,550.000000,534.640000,NaN,5.000000
75%,1750.250000,NaN,574.000000,756.435000,NaN,7.000000
max,2000.000000,NaN,599.000000,999.440000,NaN,9.000000

In [10]:
dataset_vendas.columns

Index(['ID_Pedido', 'Data_Compra', 'Cliente_ID', 'Valor_Total',
       'Categoria_Produto', 'Quantidade'],
      dtype='object')

In [11]:
nome_colunas = list(dataset_vendas.columns)

novas_colunas = []

for coluna in nome_colunas:
    novas_colunas.append(coluna.lower())

dataset_vendas.columns = novas_colunas

dataset_vendas.head()

,id_pedido,data_compra,cliente_id,valor_total,categoria_produto,quantidade
0,1001,2024-01-01,551,607.50,Roupas,1
1,1002,2024-01-02,592,758.17,Beleza,2
2,1003,2024-01-05,514,460.08,Roupas,6
3,1004,2024-01-04,571,171.20,Eletrônicos,5
4,1005,2024-01-05,560,319.59,Beleza,7

In [12]:
dataset_vendas.columns = [coluna.lower() for coluna in list(dataset_vendas.columns)]

dataset_vendas

,id_pedido,data_compra,cliente_id,valor_total,categoria_produto,quantidade
0,1001,2024-01-01,551,607.50,Roupas,1
1,1002,2024-01-02,592,758.17,Beleza,2
2,1003,2024-01-05,514,460.08,Roupas,6
3,1004,2024-01-04,571,171.20,Eletrônicos,5
4,1005,2024-01-05,560,319.59,Beleza,7
...,...,...,...,...,...,...
995,1996,2026-09-22,509,834.76,Beleza,4
996,1997,2026-09-23,566,792.93,Esportes,3
997,1998,2026-09-24,517,723.31,Beleza,3
998,1999,2026-09-25,599,84.35,Beleza,3
999,2000,2026-09-26,585,337.97,Eletrônicos,6

In [13]:
dataset_vendas['categoria_produto'].value_counts()

categoria_produto
Esportes       220
Beleza         206
Eletrônicos    199
Casa           193
Roupas         182
Name: count, dtype: int64

In [14]:
# média
media = dataset_vendas['quantidade'].mean()

# mediana
mediana = dataset_vendas['quantidade'].median()

# moda
moda = dataset_vendas['quantidade'].mode()

# variancia
variancia = dataset_vendas['quantidade'].var()

# desvio padrão
desvio = dataset_vendas['quantidade'].std()

# desvio padrão
desvio = round(dataset_vendas['quantidade'].std(ddof=1), 3)

print(f'Media: {media}')
print(f'Mediana: {mediana}')
print(f'Moda: {moda}')
print(f'Variancia: {variancia}')
print(f'Desvio padrão: {desvio}')

Media: 4.945
Mediana: 5.0
Moda: 0    1
Name: quantidade, dtype: int64
Variancia: 6.8348098098098085
Desvio padrão: 2.614